# Statistics

In [18]:
import pandas as pd
df=pd.read_excel('weather_data_xl.xlsx')
df

        Date        City  Temperature_C  Humidity_% Condition
0 2025-01-01    Hyderbad             28          60     Sunny
1 2025-01-02    Hyderbad             29          62     Sunny
2 2025-01-03    Hyderbad             30          58    Cloudy
3 2025-01-04    Hyderbad             31          55    Cloudy
4 2025-01-05    Banglore             32          57     Rainy
5 2025-01-06    Banglore             33          59     Rainy
6 2025-01-07    Banglore             34          61     Sunny
7 2025-01-08    Banglore             32          63    Cloudy
8 2025-01-09  Vijayawada             31          64     Rainy
9 2025-01-10  Vijayawada             29          62     Sunny

In [13]:
df["Temperature_C"].std()

1.911950719959998

In [14]:
df["Temperature_C"].min()

28

In [15]:
df["Temperature_C"].max()

34

In [16]:
df["Temperature_C"].var()

3.6555555555555554

In [19]:
df["Temperature_C"].describe()

count    10.000000
mean     30.900000
std       1.911951
min      28.000000
25%      29.250000
50%      31.000000
75%      32.000000
max      34.000000
Name: Temperature_C, dtype: float64

In [20]:
df["Temperature_C"].mean()

np.float64(30.9)

In [21]:
df.City[df.Temperature_C==df.Temperature_C.max()]

6    Banglore
Name: City, dtype: object

In [23]:
df[df.Temperature_C==df.Temperature_C.max()]

        Date      City  Temperature_C  Humidity_% Condition
6 2025-01-07  Banglore             34          61     Sunny

In [25]:
df["City"].value_counts()

City
Hyderbad      4
Banglore      4
Vijayawada    2
Name: count, dtype: int64

In [27]:
df["City"].nunique()

3

# String Cleaning

In [28]:
df

        Date        City  Temperature_C  Humidity_% Condition
0 2025-01-01    Hyderbad             28          60     Sunny
1 2025-01-02    Hyderbad             29          62     Sunny
2 2025-01-03    Hyderbad             30          58    Cloudy
3 2025-01-04    Hyderbad             31          55    Cloudy
4 2025-01-05    Banglore             32          57     Rainy
5 2025-01-06    Banglore             33          59     Rainy
6 2025-01-07    Banglore             34          61     Sunny
7 2025-01-08    Banglore             32          63    Cloudy
8 2025-01-09  Vijayawada             31          64     Rainy
9 2025-01-10  Vijayawada             29          62     Sunny

In [29]:
df["City"]=df["City"].str.lower()
df

        Date        City  Temperature_C  Humidity_% Condition
0 2025-01-01    hyderbad             28          60     Sunny
1 2025-01-02    hyderbad             29          62     Sunny
2 2025-01-03    hyderbad             30          58    Cloudy
3 2025-01-04    hyderbad             31          55    Cloudy
4 2025-01-05    banglore             32          57     Rainy
5 2025-01-06    banglore             33          59     Rainy
6 2025-01-07    banglore             34          61     Sunny
7 2025-01-08    banglore             32          63    Cloudy
8 2025-01-09  vijayawada             31          64     Rainy
9 2025-01-10  vijayawada             29          62     Sunny

In [30]:
df["City"]=df["City"].str.upper()
df

        Date        City  Temperature_C  Humidity_% Condition
0 2025-01-01    HYDERBAD             28          60     Sunny
1 2025-01-02    HYDERBAD             29          62     Sunny
2 2025-01-03    HYDERBAD             30          58    Cloudy
3 2025-01-04    HYDERBAD             31          55    Cloudy
4 2025-01-05    BANGLORE             32          57     Rainy
5 2025-01-06    BANGLORE             33          59     Rainy
6 2025-01-07    BANGLORE             34          61     Sunny
7 2025-01-08    BANGLORE             32          63    Cloudy
8 2025-01-09  VIJAYAWADA             31          64     Rainy
9 2025-01-10  VIJAYAWADA             29          62     Sunny

In [32]:
df["City"]=df["City"].str.replace("HYDERBAD","CHENNAI")
df

        Date        City  Temperature_C  Humidity_% Condition
0 2025-01-01     CHENNAI             28          60     Sunny
1 2025-01-02     CHENNAI             29          62     Sunny
2 2025-01-03     CHENNAI             30          58    Cloudy
3 2025-01-04     CHENNAI             31          55    Cloudy
4 2025-01-05    BANGLORE             32          57     Rainy
5 2025-01-06    BANGLORE             33          59     Rainy
6 2025-01-07    BANGLORE             34          61     Sunny
7 2025-01-08    BANGLORE             32          63    Cloudy
8 2025-01-09  VIJAYAWADA             31          64     Rainy
9 2025-01-10  VIJAYAWADA             29          62     Sunny

# Concate Data Frames

In [5]:
import pandas as pd
india_weather = pd.DataFrame({
    "city":["mumbai","banglore","hyderabad"],
    "Temperature":[32,45,35]
})
india_weather

        city  Temperature
0     mumbai           32
1   banglore           45
2  hyderabad           35

In [7]:
import pandas as pd
US_weather = pd.DataFrame({
    "city":["new york","chicago","orlando"],
    "Temperature":[32,45,35]
})
US_weather

       city  Temperature
0  new york           32
1   chicago           45
2   orlando           35

In [8]:
df=pd.concat([india_weather,US_weather])
df

        city  Temperature
0     mumbai           32
1   banglore           45
2  hyderabad           35
0   new york           32
1    chicago           45
2    orlando           35

In [9]:
df=pd.concat([india_weather,US_weather],ignore_index=True)
df

        city  Temperature
0     mumbai           32
1   banglore           45
2  hyderabad           35
3   new york           32
4    chicago           45
5    orlando           35

In [10]:
df=pd.concat([india_weather,US_weather],axis=1)
df

        city  Temperature      city  Temperature
0     mumbai           32  new york           32
1   banglore           45   chicago           45
2  hyderabad           35   orlando           35

# Merge DataFrames

In [12]:
temp_df=pd.DataFrame({
    "city":["Hyderabad","Vijayawada","Visakhapatnam","Chennai"],
    "temperature":[32,45,30,35]})
temp_df

            city  temperature
0      Hyderabad           32
1     Vijayawada           45
2  Visakhapatnam           30
3        Chennai           35

In [21]:
humidity_df=pd.DataFrame({
    "city":["Hyderabad","Vijayawada","Visakhapatnam","Banglore"],
    "humidity":[42,75,50,90]})
humidity_df

            city  humidity
0      Hyderabad        42
1     Vijayawada        75
2  Visakhapatnam        50
3       Banglore        90

In [22]:
df=pd.merge(temp_df,humidity_df,on="city")
df

            city  temperature  humidity
0      Hyderabad           32        42
1     Vijayawada           45        75
2  Visakhapatnam           30        50

In [23]:
df=pd.merge(temp_df,humidity_df,on="city",how="outer")
df

            city  temperature  humidity
0       Banglore          NaN      90.0
1        Chennai         35.0       NaN
2      Hyderabad         32.0      42.0
3     Vijayawada         45.0      75.0
4  Visakhapatnam         30.0      50.0

In [24]:
df.isnull()

    city  temperature  humidity
0  False         True     False
1  False        False      True
2  False        False     False
3  False        False     False
4  False        False     False

In [25]:
df.isnull().sum()

city           0
temperature    1
humidity       1
dtype: int64

In [29]:
df['temperature']=df['temperature'].fillna(df.temperature.min())

In [30]:
df.isnull()

    city  temperature  humidity
0  False        False     False
1  False        False      True
2  False        False     False
3  False        False     False
4  False        False     False

In [32]:
df['humidity']=df['humidity'].fillna(df.temperature.min())

In [33]:
df.isnull()

    city  temperature  humidity
0  False        False     False
1  False        False     False
2  False        False     False
3  False        False     False
4  False        False     False